[Killed] BlockStatement
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-primes/sumAllPrimes.js:2:36
-function AddNumberFromArray(array) {
-  return array.reduce(
-    (accumulator, currentValue) => accumulator + currentValue
-  );
-}
+function AddNumberFromArray(array) {}
 
 function sumPrimes(num) {
killedBy: Sum All Primes sumPrimes() sumPrimes(10) should return a number.
statusReason: Error: expect(received).toBeNumber()

Expected value to be a number received:
  undefined

[Killed] ArrowFunction
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-primes/sumAllPrimes.js:4:5
 function AddNumberFromArray(array) {
   return array.reduce(
-    (accumulator, currentValue) => accumulator + currentValue
+    () => undefined
   );
 }
killedBy: Sum All Primes sumPrimes() sumPrimes(10) should return a number.
statusReason: Error: expect(received).toBeNumber()

Expected value to be a number received:
  undefined

[Killed] ArithmeticOperator
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-primes/sumAllPrimes.js:4:36
 function AddNumberFromArray(array) {
   return array.reduce(
-    (accumulator, currentValue) => accumulator + currentValue
+    (accumulator, currentValue) => accumulator - currentValue
   );
 }
killedBy: Sum All Primes sumPrimes() sumPrimes(10) should return 17.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 17
Received: -13

[Killed] BlockStatement
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-primes/sumAllPrimes.js:8:25
   );
 }
 
-function sumPrimes(num) {
-  const listOfConsecutiveIntegersFrom2 = createListOfConsecutiveIntegersFrom2(num);
-  const arrayOfPrimeNumbers = primeNumbersOfArray(
-    listOfConsecutiveIntegersFrom2
-  );
-  const sumOfNumberFromArray = AddNumberFromArray(arrayOfPrimeNumbers);
-  return sumOfNumberFromArray;
-}
+function sumPrimes(num) {}
 function createListOfConsecutiveIntegersFrom2(num) {
   if (num > 1) {
killedBy: Sum All Primes sumPrimes() sumPrimes(10) should return a number.
statusReason: Error: expect(received).toBeNumber()

Expected value to be a number received:
  undefined

[Survived] ConditionalExpression
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-primes/sumAllPrimes.js:17:7
   return sumOfNumberFromArray;
 }
 function createListOfConsecutiveIntegersFrom2(num) {
-  if (num > 1) {
+  if (true) {
     const listOfConsecutiveIntegersFrom2 = [];
     for (var i = 2; i <= num; i++) {

[Survived] EqualityOperator
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-primes/sumAllPrimes.js:17:7
   return sumOfNumberFromArray;
 }
 function createListOfConsecutiveIntegersFrom2(num) {
-  if (num > 1) {
+  if (num >= 1) {
     const listOfConsecutiveIntegersFrom2 = [];
     for (var i = 2; i <= num; i++) {

[Killed] EqualityOperator
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-primes/sumAllPrimes.js:19:21
 function createListOfConsecutiveIntegersFrom2(num) {
   if (num > 1) {
     const listOfConsecutiveIntegersFrom2 = [];
-    for (var i = 2; i <= num; i++) {
+    for (var i = 2; i < num; i++) {
       listOfConsecutiveIntegersFrom2.push(i);
     }
killedBy: Sum All Primes sumPrimes() sumPrimes(977) should return 73156.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 73156
Received: 72179

[Timeout] UpdateOperator
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-primes/sumAllPrimes.js:19:31
 function createListOfConsecutiveIntegersFrom2(num) {
   if (num > 1) {
     const listOfConsecutiveIntegersFrom2 = [];
-    for (var i = 2; i <= num; i++) {
+    for (var i = 2; i <= num; i--) {
       listOfConsecutiveIntegersFrom2.push(i);
     }

[Killed] EqualityOperator
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-primes/sumAllPrimes.js:26:7
   }
 }
 function isPrime(num) {
-  if (num < 2) return false;
+  if (num <= 2) return false;
 
   /**
killedBy: Sum All Primes sumPrimes() sumPrimes(10) should return 17.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 17
Received: 15

[Survived] ConditionalExpression
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-primes/sumAllPrimes.js:26:7
   }
 }
 function isPrime(num) {
-  if (num < 2) return false;
+  if (false) return false;
 
   /**

[Killed] EqualityOperator
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-primes/sumAllPrimes.js:34:19
 
   var squareRoot = Math.floor(Math.sqrt(num));
 
-  for (var i = 2; i <= squareRoot; i++) {
+  for (var i = 2; i < squareRoot; i++) {
     if (num % i == 0) {
       return false;
killedBy: Sum All Primes sumPrimes() sumPrimes(10) should return 17.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 17
Received: 44

[Killed] EqualityOperator
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-primes/sumAllPrimes.js:34:19
 
   var squareRoot = Math.floor(Math.sqrt(num));
 
-  for (var i = 2; i <= squareRoot; i++) {
+  for (var i = 2; i > squareRoot; i++) {
     if (num % i == 0) {
       return false;
killedBy: Sum All Primes sumPrimes() sumPrimes(10) should return 17.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 17
Received: 49

[Killed] ConditionalExpression
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-primes/sumAllPrimes.js:35:9
   var squareRoot = Math.floor(Math.sqrt(num));
 
   for (var i = 2; i <= squareRoot; i++) {
-    if (num % i == 0) {
+    if (true) {
       return false;
     }
killedBy: Sum All Primes sumPrimes() sumPrimes(10) should return 17.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 17
Received: 5

[Killed] EqualityOperator
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-primes/sumAllPrimes.js:35:9
   var squareRoot = Math.floor(Math.sqrt(num));
 
   for (var i = 2; i <= squareRoot; i++) {
-    if (num % i == 0) {
+    if (num % i != 0) {
       return false;
     }
killedBy: Sum All Primes sumPrimes() sumPrimes(10) should return 17.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 17
Received: 23

[Killed] BooleanLiteral
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-primes/sumAllPrimes.js:36:14
 
   for (var i = 2; i <= squareRoot; i++) {
     if (num % i == 0) {
-      return false;
+      return true;
     }
   }
killedBy: Sum All Primes sumPrimes() sumPrimes(10) should return 17.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 17
Received: 54

[Killed] ConditionalExpression
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-primes/sumAllPrimes.js:46:6
 function primeNumbersOfArray(array) {
   const arrayOfPrimeNumbers = []
   array.forEach(element => {
-  if(isPrime(element)) arrayOfPrimeNumbers.push(element)
+  if(true) arrayOfPrimeNumbers.push(element)
 });
   return arrayOfPrimeNumbers
killedBy: Sum All Primes sumPrimes() sumPrimes(10) should return 17.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 17
Received: 54
